############### 1 ################

############### 2 ################

############### 3 ################

############### 4 ################

############### 5 ################
k=[10,10,20,40,35,30,10,10,20,40,35,30,10,10,20,40,35,30,10,10,20,40,35,30,10,10,20,40,35,30,10,20,40,35,30,10,10,20,40,35,30,10]
t=str(sum(k))
print("Общее число учеников ",t)
if len(t)==4 :
    print(" есть четырехзначное число")
else :
    print(" не является четырехзначным числом")

############### 6 ################
def main(l):
    print(*(i for i in l if i[-1] == '0'))
lst = input().split()
main(lst)

############### 7 ################

############### 8 ################
a = [int(i) for i in input().split()]
num_distinct = 1
for i in range(0, len(a) - 1):
    if a[i] != a[i + 1]:
        num_distinct += 1
print(num_distinct)

############### 9 ################
a = [int(i) for i in input().split()]
for i in range(1, len(a), 2):
    a[i - 1], a[i] = a[i], a[i - 1]
print(' '.join([str(i) for i in a]))

############### 10 ###############

############### 11 ###############

############### 12 ###############
