############## 1 ##############

print("Задача 1 не сделана")

############## 2 ##############

print("Задача 2 не сделана")

############## 3 ##############

print("Задача 3 не сделана")

############## 4 ##############

print("Задача 4")
n4 = float(input("Введите первое число: "))
n44 = float(input("Введите второе число: "))
if n4 > n44:
    print(n4, '- большее числоn', n44, '- меньшее число')
elif n44 > n4:
    print(n44, '- большее числоn', n4, '- меньшее число')
    
############## 5 ##############

print("Задача 5")
a5 = int(input("Введите первое число: "))
b5 = int(input("Введите второе число: "))
print((a5 + b5 - abs(a5 - b5)) / 2)
print((a5 + b5 + abs(a5 - b5)) / 2)

############## 6 ##############

print("Задача 6")
y1 = int(input())
m1 = int(input())
y2 = int(input())
m2 = int(input())
print(((y2 - y1) * 12 + m2 - m1) // 12)

############## 7 ##############

print("Задача 7")
from math import sin
x7 = int(input("x="))
if x7 > 0:
    y7 = sin(x7)**2
else:
    y7 = 1 - (2 * sin(x7 * x7))
print(y7)

############## 8 ##############

print("Задача 8 не сделана")

############## 9 ##############

print("Задача 9")
b9 = int(input())
a9 = int(input())
if b9 % a9 == 0:
    print ("да")
else:
    print ("нет")
    
############## 10 ##############

print("Задача 10")
n10 = int(input())
if n10 % 2 == 0:
    print('Число четное')
else:
    print('Число нечетное')
 
if n10 % 10 == 7:
    print('Число оканчивается на 7')
else:
    print('Число не оканчивается на 7')
    
############## 11 ##############

print("Задача 11")
n11 = int(input())
max1 = max(n % 10, n // 10)
check = False
if max1 == n11 // 10 != n11 % 10:
    check = True
    print('Первая цифра числа больше')
elif max1 == n11 % 10 != n11 // 10:
    check = True
    print('Вторая цифра числа больше')
if not check:
    print('Цифры числа одинаковы')
else:
    print('Цифры числа различны')

############## 12 ##############

print("Задача 12")
n12 = input("Введите целое трехзначное число: ")
if n12 == n12[2]+n12[1]+n12[0]:
    print("Палиндром")
else:
    print("Не палиндром")
    
############## 13 ##############

print("Задача 13")
num = int(input('Введите число: '))
number_1 = num // 100
number_2 = num // 10 % 10
number_3 = num % 10
if number_1 == number_2 == number_3:
    print('a) Да')
else:
    print('a) Нет')
if number_1 == number_2 or number_1 == number_3 or number_2 == number_3:
    print('б) Да')
else:
    print('б) Нет')
    
############## 14 ##############

print("Задача 14")
n14 = int(input('Введите число: '))
a14 = n14 % 10 % 2 == 0
b14 = n14 % 10 % 2 != 0
print('а)',a14)
print('б)',b14)

############## 15 ##############

print("Задача 15")
print('Зеленый' if 0 <= float(input()) % 5 <= 3 else 'Красный')

############## 16 ##############

print("Задача 16")
M16 = int(input("Введите массу в килограммах (M): "))
m16 = int(M16 / 1000)
print("Количество полных тонн: ", m16)

############## 17 ##############

print("Задача 17 не сделана")
